# S&P 500 ETL Project

### This notebook performs the followins tasks:

1. Create a connection to the MySQL database hosted in the Linode Server
2. Query the database
3. Serve as baseline for the script that will be run on the Flask server

### Load Lybraries

In [1]:
import pandas as pd
import os
import numpy as np
import matplotlib.pyplot as plt
from matplotlib.ticker import StrMethodFormatter
import datetime as dt


# Import DB user and password
from api_keys import mysql_hostname
from api_keys import mysql_port
from api_keys import mysql_username
from api_keys import mysql_pass

### Connect to the Database

In [2]:
# MySQL specific connection string
database_name = 'etlprojectdb'
table_price = 'price'
table_companies = 'companies'
table_subsectors = 'sub_sectors'
database_url = f"mysql+mysqlconnector://{mysql_username}:{mysql_pass}@{mysql_hostname}:{mysql_port}/{database_name}"

In [3]:
# Create the engine
from sqlalchemy import create_engine
engine = create_engine(database_url)
connection = engine.connect()

### Time Query

In [4]:
# date and time of the database
pd.read_sql(f"SELECT now();", engine)

                now()
0 2020-10-23 07:08:16

### Query Database

In [5]:
# Select all the companies from the database
companies_df = pd.read_sql(f"SELECT * FROM {table_companies}", engine)

In [6]:
# Show the first companies on the dataset
companies_df.head()

Empty DataFrame
Columns: [id, comp_tick, comp_name, sect_id, sect_name, sub_sect_id, first_trade_date]
Index: []

In [7]:
# Select all the companies from the database
subsectors_df = pd.read_sql(f"SELECT * FROM {table_subsectors}", engine)

In [8]:
# Show the first companies on the dataset
subsectors_df.head()

Empty DataFrame
Columns: [id, sub_sect_id, sect_id, sect_name, sub_sect_name]
Index: []

In [9]:
# Select all the companies from the database
price_df = pd.read_sql(f"SELECT * FROM {table_price}", engine)

In [10]:
# Show the first companies on the dataset
price_df.head()

Empty DataFrame
Columns: [id, comp_tick, date, close_price, volume, currency]
Index: []

### Data Wrangling

### Data Analysis